server/artillery/api_test.yaml
config:
  target : 'http://localhost:3000'
  phases:
    - duration: 40
      arrivalRate: 1
      name: Warm up
#    - duration: 120
#      arrivalRate: 5
#      rampTo: 50
#      name: Ramp up load
#    - duration: 600
#      arrivalRate: 50
#      name: Sustained load

before:
  flow:
    - post:
        url : '/api/user/auth/signin'
        json:
          id: 'knytest@gmail.com'
          password: '12341234'
        capture:
          json: '$.result.accessToken'
          as: accessToken
        expect:
          - statusCode: 201
scenarios:
  - flow:
      - get:
          url: '/api/users?search=t'
        headers:
          authorization: 'Bearer {{accessToken}}'
      - get:
          url: '/api/user/followings'
          headers:
            authorization: 'Bearer {{accessToken}}'
      - think : 1
      - get:
          url: '/api/user/auth/me'
          headers:
            authorization: 'Bearer {{accessToken}}'
      - get:
          url: '/api/channels/639846568ad1c10ed60d9653'
          headers:
            authorization: 'Bearer {{accessToken}}'
      - get:
          url: '/api/communities/63997033a59cf95317119f62/users'
          headers:
            authorization: 'Bearer {{accessToken}}'
      - get:
          url: '/api/communities'
          headers:
            authorization: 'Bearer {{accessToken}}'
      - think : 1
      - get:
          url: '/api/communities/63956c42d1a615bf564e3af6/users'
          headers:
            authorization: 'Bearer {{accessToken}}'